music_app/app/models/user.rb

UPDATE "users" SET "session_token" = $1 WHERE "users"."id" = $2  [["session_token", "xFDLFIe9_aAnoaIwcajm3g"], ["id", 1]]
---
    def reset_session_token!
        # regenerate the session token to a new value, then save and return it
        self.session_token = SecureRandom::urlsafe_base64
        self.save!

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "Testguy"], ["LIMIT", 1]]
---
    def self.find_by_credentials(target_email, password)
        # find a specific user by email
        user = User.find_by(email: target_email)