music_app/app/controllers/application_controller.rb

    def current_user # returns current user
        @current_user ||= User.find_by(session_token: session[:session_token])
---
SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "xFDLFIe9_aAnoaIwcajm3g"], ["LIMIT", 1]]