music_app/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        @users = User.find(params[:id])

INSERT INTO "users" ("email", "password_digest", "session_token") VALUES ($1, $2, $3) RETURNING "id"  [["email", "Testguy"], ["password_digest", "$2a$12$ehmYV0j6x8wgCfPVtRjU4eICuA1ste5r7tFnOCZxQswS/lXGBUQdi"], ["session_token", "H0IXnKdkL2I5_tjAq1YX8g"]]
---
    def create
        @user = User.new(user_params)

        # if user is successfully created, log them in and
        # redirect to user index view
        if @user.save